/* Начало проектной работы. */

/* Создание таблиц и представлений для своего проекта. Если вы не сделали этого раньше,
 * придумайте и сделайте краткое описание проекта, который будете делать в рамках всего курса.

 * Нужно используя операторы DDL создать:
 * 1. Создать базу данных.
 * 2. 3-4 основные таблицы для своего проекта.
 * 3. Первичные и внешние ключи для всех созданных таблиц.
 * 4. 1-2 индекса на таблицы.
 * 5. Наложите по одному ограничению в каждой таблице на ввод данных.

 * В качестве проекта вы можете взять любую идею, которая вам близка.
 * Это может быть какая-то часть вашего рабочего проекта, которую вы хотите переосмыслить.
 * Если есть идея, но не понятно как ее уложить в рамки учебного проекта, напишите преподавателю и мы поможем.
 * Проект мы будем делать весь курс и защищать его в самом конце, он будет заключаться в созданной БД со схемой,
 * описанием проекта, и необходимыми процедурами\функциями или SQL кодом для демонстрации основного функционала системы.
 * Создать в github папку с проектом, создать там описание проекта - о чем он, какие функции будут реализованы, 
 * основные сущности, которые затем будут созданы (просто описание текстом).
 */


 -- Описание:
 -- Проект хранилища данных(DWH) по договорам одного вида страхования